results/runs/ycsb/2026-05-17T10-00-34/mongodb/run_workload_f.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloadf -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloadf -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-17 10:00:17:805 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongodb:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 10:00:27:107 9 sec: 78611 operations; 8402.2 current ops/sec; est completion in 3 second [READ: Count=78647, Max=95551, Min=216, Avg=771.8, 90=1351, 99=5015, 99.9=13351, 99.99=88127] [READ-MODIFY-WRITE: Count=39205, Max=135679, Min=488, Avg=1570.54, 90=2831, 99=8003, 99.9=19903, 99.99=31615] [UPDATE: Count=39275, Max=26159, Min=236, Avg=786.96, 90=1373, 99=5063, 99.9=13895, 99.99=21567] 
2026-05-17 10:00:29:770 12 sec: 100000 operations; 8028.9 current ops/sec; [READ: Count=21353, Max=43455, Min=216, Avg=791.77, 90=1360, 99=5503, 99.9=13671, 99.99=22255] [READ-MODIFY-WRITE: Count=10540, Max=30623, Min=473, Avg=1600.71, 90=2853, 99=8207, 99.9=16119, 99.99=28335] [CLEANUP: Count=10, Max=7731, Min=2, Avg=778.3, 90=18, 99=7731, 99.9=7731, 99.99=7731] [UPDATE: Count=10470, Max=29711, Min=225, Avg=819.73, 90=1412, 99=5771, 99.9=11767, 99.99=27999] 
[OVERALL], RunTime(ms), 12020
[OVERALL], Throughput(ops/sec), 8319.467554076538
[TOTAL_GCS_G1_Young_Generation], Count, 31
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 220
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.8302828618968388
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 31
[TOTAL_GC_TIME], Time(ms), 220
[TOTAL_GC_TIME_%], Time(%), 1.8302828618968388
[READ], Operations, 100000
[READ], AverageLatency(us), 776.06154
[READ], MinLatency(us), 216
[READ], MaxLatency(us), 95551
[READ], 95thPercentileLatency(us), 2091
[READ], 99thPercentileLatency(us), 5171
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49745
[READ-MODIFY-WRITE], AverageLatency(us), 1576.9313900894563
[READ-MODIFY-WRITE], MinLatency(us), 473
[READ-MODIFY-WRITE], MaxLatency(us), 135679
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 4061
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 8079
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 778.3
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 7731
[CLEANUP], 95thPercentileLatency(us), 7731
[CLEANUP], 99thPercentileLatency(us), 7731
[UPDATE], Operations, 49745
[UPDATE], AverageLatency(us), 793.8587194692934
[UPDATE], MinLatency(us), 225
[UPDATE], MaxLatency(us), 29711
[UPDATE], 95thPercentileLatency(us), 2135
[UPDATE], 99thPercentileLatency(us), 5219
[UPDATE], Return=OK, 49745